//Сумма цифр
//Напишите функцию, которая находит сумму цифр десятеричного представления числа.
//
//unsigned int sum_of_numbers(unsigned int n);
//Аргументы
//Одно целое положительное число.
//
//Возвращаемое значение
//Сумма цифр полученного числа.
//
//Инфраструктура(код, который можно использовать при отладке)
//Программа вычисляет и выводит на экран сумму цифр введенного с экрана числа.Можете использовать код предыдущей программы.

//#include <iostream>
//using namespace std;
//
//unsigned int sum_of_numbers(unsigned int n)
//{
//   int res = 0;
//   while (n)
//   {
//       int number = n % 10;
//       res += number);
//       n /= 10;
//   }
//}
//
//int main()
//{
//    unsigned int n;
//    cin >> n;
//    cout << sum_of_numbers(n) << endl;
//    return 0;
//}