//Двоичное разложение
//Напишите функцию, которая выводит на экран двоичное представление числа. Подумайте, как можно использовать рекурсию, чтобы вывести цифры в правильном порядке.
//
//void binary(unsigned int n);
//Аргументы
//Одно целое положительное число.
//
//Возвращаемое значение
//Отсутствует.
//
//Инфраструктура(код, который можно использовать при отладке)
//Программа выводит на экран двоичное разложение введенного числа.
//#include <iostream>
//#include <cstring>
//using namespace std;
//


//#include <iostream>
//using namespace std;
//
//void binary(unsigned int n)
//{
//    if (n >= 2) 
//        binary(n / 2);
//    cout << n % 2;
//    return;
//}
//
//int main()
//{
//    unsigned int n;
//    cin >> n;
//    binary(n);
//    cout << endl;
//    return 0;
//}