//Сложение двух чисел
//Напишите функцию, которая складывает два целых числа.
//
//int sum(int a, int b);
//Аргументы
//Два целых числа.
//
//Возвращаемое значение
//Сумма двух чисел.
//
//Инфраструктура(код, который можно использовать при отладке)
//Программа вычисляет и выводит на экран сумму цифр введенного с экрана числа.

//#include <iostream>
//using namespace std;
//
//int sum(int a, int b)
//{
//    return a + b;
//}
//
//int main()
//{
//    int n, res = 0;
//    cin >> n;
//    while (n)
//    {
//        int number = n % 10;
//        res = sum(res, number);
//        n /= 10;
//    }
//    cout << res << endl;
//    return 0;
//}